load_test_results.txt
🔥 RAUTA HTTP/2 PROGRESSIVE LOAD TESTS
Started: Sun Nov  2 00:31:37 CET 2025

Running 5s test @ http://127.0.0.1:8081/api/test
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   130.96us   92.76us   4.27ms   97.84%
    Req/Sec    38.29k     2.55k   40.75k    84.31%
  388566 requests in 5.10s, 55.21MB read
Requests/sec:  76188.17
Transfer/sec:     10.83MB

Running 10s test @ http://127.0.0.1:8081/api/test
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   536.24us  202.95us  14.73ms   96.45%
    Req/Sec    22.19k     1.49k   23.82k    85.89%
  892076 requests in 10.10s, 126.76MB read
Requests/sec:  88328.13
Transfer/sec:     12.55MB

Running 10s test @ http://127.0.0.1:8081/api/test
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.72ms    2.47ms  91.50ms   94.53%
    Req/Sec    17.80k     5.04k   26.31k    78.00%
  709764 requests in 10.05s, 100.86MB read
Requests/sec:  70641.86
Transfer/sec:     10.04MB

Running 10s test @ http://127.0.0.1:8081/api/test
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    2.31ms 106.14ms   95.41%
    Req/Sec     9.73k     1.73k   22.57k    86.12%
  775510 requests in 10.04s, 110.20MB read
Requests/sec:  77257.83
Transfer/sec:     10.98MB

Running 10s test @ http://127.0.0.1:8081/api/test
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.79ms    1.07ms  34.22ms   90.85%
    Req/Sec     6.92k     1.50k   41.32k    94.93%
  827617 requests in 10.10s, 117.60MB read
Requests/sec:  81915.29
Transfer/sec:     11.64MB

Running 10s test @ http://127.0.0.1:8081/api/test
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.33ms    0.85ms  28.86ms   91.19%
    Req/Sec     7.10k   264.34     7.62k    86.75%
  847490 requests in 10.01s, 120.43MB read
Requests/sec:  84629.61
Transfer/sec:     12.03MB

Completed: Sun Nov  2 00:32:33 CET 2025