loadtest_workers.txt
Running 30s test @ http://127.0.0.1:8080/
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  0 requests in 30.10s, 0.00B read
  Socket errors: connect 0, read 852056, write 0, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B